@ui
Feature: Создание заявки на рождение (тестирование с использованием Cucumber)
  Scenario: Пользователь успешно создает заявку на рождение
    Given пользователь находится на главной странице и выбирает роль пользователь
    When пользователь заполняет данные заявителя
    And пользователь выбирает услугу Регистрация рождения
    And пользователь заполняет данные гражданина
    And пользователь заполняет данные услуги
    Then на странице статуса отображается номер заявки
    And статус заявки равен "На рассмотрении"
